import React from "react";
import styled from "styled-components";

const Geeta = styled.div`
  width: auto;
  text-align: center;
  padding: 20px;
  img {
    max-width: 100%;
    height: auto;
  }
  @media (max-width: 768px) {
   
  }
`;

function GeetaSaar() {
  return (
    <Geeta>
      <img
        src="https://i.pinimg.com/originals/c9/b7/cf/c9b7cfa1a5d294b63d899ba93bc2b011.jpg"
        alt="Logo"
      />
      <br/>
      <br/>
      <p>
      कुरुक्षेत्र की पृष्ठभूमि में ५००० वर्ष पूर्व भगवान श्रीकृष्ण ने अर्जुन को उपदेश दिया जो श्रीमद्भगवदगीता के नाम से प्रसिद्ध है |
      यह कौरवों व पांडवों के बीच युद्ध महाभारत के भीष्मपर्व का अंग है। जैसा गीता के शंकर भाष्य में कहा है- 
      <br/>
      <b><i>तं धर्मं भगवता यथोपदिष्ट वेदव्यासः सर्वज्ञोभगवान् गीताख्यैः सप्तभिः श्लोकशतैरु पनिबन्ध। 
      </i></b>
      <br/>
      गीता में 18 अध्याय और 700 श्लोक हैं।
      गीता की गणना प्रस्थानत्रयी में की जाती है, जिसमें उपनिषद् और ब्रह्मसूत्र भी सम्मिलित हैं। अतएव भारतीय परम्परा के अनुसार गीता का 
      स्थान वही है जो उपनिषद् और धर्मसूत्रों का है। उपनिषदों को गौ और गीता को उसका दुग्ध कहा गया है। 
      इसका तात्पर्य यह है कि उपनिषदों की जो अध्यात्म विद्या थी, उसको गीता सर्वांश में स्वीकार करती है। उपनिषदों की अनेक विद्याएँ गीता 
      में हैं। जैसे, संसार के स्वरूप के संबंध में अश्वत्थ विद्या, अनादि अजन्मा ब्रह्म के विषय में अव्ययपुरुष विद्या, परा प्रकृति या जीव के विषय 
      में अक्षरपुरुष विद्या और अपरा प्रकृति या भौतिक जगत के विषय में क्षरपुरुष विद्या। इस प्रकार वेदों के ब्रह्मवाद और उपनिषदों के अध्यात्म,
       इन दोनों की विशिष्ट सामग्री गीता में संनिविष्ट है। उसे ही पुष्पिका के शब्दों में ब्रह्मविद्या कहा गया है।
       </p>
       <br></br>
       <p>
       कल्याण की इच्छा वाले मनुष्यों को उचित है कि मोह का त्याग कर अतिशय श्रद्धा-भक्तिपूर्वक अपने बच्चों को अर्थ और भाव के साथ श्रीगीताजी का अध्ययन कराएँ।
       स्वयं भी इसका पठन और मनन करते हुए भगवान की आज्ञानुसार साधन करने में समर्थ हो जाएँ क्योंकि अतिदुर्लभ मनुष्य शरीर को प्राप्त
       होकर अपने अमूल्य समय का एक क्षण भी दु:खमूलक क्षणभंगुर भोगों के भोगने में नष्ट करना उचित नहीं है।
       </p>
    </Geeta>
  );
}

export default GeetaSaar;
